#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Fri Mar 28 14:40:32 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
#Написати функцију која, за унети низ, враћа суму парних цифара у низу.
# def niz(niz):
#     suma=0
#     for clan in niz:
#         if clan%2==0:
#             suma+=clan
#     return suma
 
# x=map(int,input("Unesite x").split())
#===================================================================
    

 
#===================================================================
#Zadatak  2
#Написати функцију која, за унети низ, враћа низ парних цифара.
# def parnec(niz):
#     parni=[]
#     for clan in niz:
#         if clan%2==0:
#             parni.append(clan)
#     return parni
#===================================================================  
 
    
#===================================================================
#Zadatak  3
#Написати функцију која, за унети низ, враћа члан низа са највећом вредношћу.

# def najvezi(niz):
#     return max(niz)
#=================================================================== 
    
 
#===================================================================
#Zadatak  4
#Написати функцију која, за унети низ, враћа члан низа са најмањом вредношћу.

# def najmanji(niz):
#     return min(niz)

# def najmanji():
#     niz=list(map(int,input("Clanovi niza molim: ").split()))
#     naj=niz[0]
#     for clan in niz:
#         if  clan<naj:
#             naj=clan
#     return naj
#===================================================================  
 
    
#===================================================================
#Zadatak  5
#Написати функцију која, за унети број н, враћа збир свих природних бројева од 1 до н.

# def zbir(n):
#     zbr=0
#     for i in range(1,n+1):
#         zbr+=i 
#     return zbr
#=================================================================== 
    
 
#===================================================================
 #Zadatak  6
 #Написати функцију која, за унети број н, враћа факторијел броја н.
# def faktorijel(n):
#     mnozenje=1
#     for i in range(1,n+1):
#         mnozenje=mnozenje*i
#     return mnozenje 
 
# def faktoriel2(n):
#     mnozenje=1
#     while n>0:
#         mnozenje*=n     
#         n-=1
#     return mnozenje
 #===================================================================   
 
    
 
#===================================================================
#Zadatak  7
#Написати функцију којом се проверава да ли је дати природан број k дељив свим природним бројевима од 1 до n.
# def ispitait(k,n):
#     for i in range(1,n+1):
#         if k%i!=0:
#             return False
#     return True
#===================================================================   
 

    
 
    
 
    
 