#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Apr 21 15:52:35 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
    
#===================================================================
#Zadatak  1
#Написати функцију која враћа збир првих н бројева. Тражи се рекурзивно решење.
def zbir(n):
    if n==1:
        return 1
    else:
        return n+zbir(n-1)

#===================================================================    
    
    
#===================================================================
#Zadatak  2
#Написати функциjу коjа не користи петље, а враћа збир цифара унетог произвољног целог броjа.
def cifre(n):
    if n<10:
        return n
    else:
        return n%10 + cifre(n//10)
#===================================================================    
    
    
#===================================================================
#Zadatak  3
#Написати функциjу коjа врши израчунавање производа два броjа понављањем сабирања.
def itetbroj(x,y):
    z=0
    while y>0:
        z=z+x
        y-=1
    return z

def rekbroj(x,y):
    if y==0:
        return 0
    else:
        return x + rekbroj(x,y-1)
#===================================================================


#===================================================================
#Zadatak  4
#Написати функцију која враћа факторијел броја н.
def faktorijel(x):
    if x==1:
        return 1
    else:
        return x*faktorijel(x-1)

def faktorijeliter(x):
    rezultat=1
    while x>0:
        rezultat*=x
        x-=1
    return rezultat
#===================================================================
























    
    
    
    
    
    
    
    
    
    
    
    