#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sat Apr 26 21:17:53 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
# Задатак: Бројеви од a до b
# Ако су дати цели бројеви a и b, написати програм који исписује редом све целе бројеве у задатом интервалу
# [a, b].
# Улаз: У првој линији стандардног улаза налази се цео број a, а у другој је цео број b (−1000 ≤ a ≤
# 1000, −1000 ≤ b ≤ 1000).
# Излаз: На стандардном излазу исписују се редом сви цели бројеви из интервала, у свакој линији по један
# број.
# Пример
# Улаз
# 3
# 6
# Излаз
# 3
# 4
# 5
# 6
# a=int(input('ceo broj a:'))
# b=int(input('ceo broj b:'))
# for i in range(a,b+1):
#     print(i)
#===================================================================    
    
    
    
#===================================================================
#Zadatak  2
# Задатак: Бројање у игри жмурке
# У игри жмурке деца обично броје по пет (5, 10, 15, 20, . . .). Напиши програм који исписује баш те бројеве.
# Улаз: Са стандардног улаза уноси се број x (100 ≤ x ≤ 1000) дељив са 5.
# Излаз: На стандардни излаз исписати бројеве дељиве са 5, почевши од 5 и завршивши са x. Сваки број
# исписати у посебном реду.
# Пример
# Улаз
# 30
# Излаз
# 5
# 10
# 15
# 20
# 25
# 30

# a=int(input('ceo broj a:'))
# i=5
# while i<=a:
#     print(i)
#     i+=5
#===================================================================   
    
#===================================================================
#Zadatak  3
# Задатак: Троцифрени парни бројеви
# За дате целе бројеве a и b, написати програм који исписује редом све парне троцифрене бројеве који припадају датом интервалу [a, b]
# Улаз: Са стандардног улаза учитавају се бројеви a и b (0 ≤ a ≤ 1500 и a ≤ b ≤ 1500).
# Излаз: На стандардном излазу исписују се редом (од најмањег до највећег) сви парни троцифрени бројеви,
# у свакој линији по један број.
# Пример
# Улаз
# 85
# 109
# Излаз
# 100
# 102
# 104
# 106
# 108

# a=int(input('ceo broj a ')); b=int(input('ceo broj b '))
# i=a
# while i<=b:
#     if i//100 != 0 and i%2==0 and i<=999:
#         print(i)
#     i+=1
#===================================================================    
    
#===================================================================
#Zadatak  4
# Задатак: Одбројавање уназад
# Написати програм који одбројава уназад од датог броја до нуле.
# Улаз: Са стандардног улаза уноси се природан број a мањи од 100 од којег почиње одбројавање.
# Излаз: На стандардном излазу исписују се редом (од највећег до најмањег) сви бројеви од a до нуле. Сваки
# број приказати у посебној линији.
# Пример
# Улаз
# 3
# Излаз
# 3
# 2
# 1
# 0
# a=int(input('cela vrednost a '))
# for i in range(a,-1,-1):
#     print(i)
#===================================================================    
    
    
#===================================================================
#Zadatak  5
# Задатак: Најаве емисије у правилним временским интервалима
# Познат је почетак и крај једног филма (времена у сатима и минутима). У правилним временским интервалима, прво на почетку филма и затим након сваких m минута у углу екрана се приказује најава следеће емисије.
# Напиши програм који исписује времена у којима се приказује та најава.
# Улаз: На стандардном улазу налази се време почетка филма дато у облику два цела броја, сваког у засебној
# линији који представљају број сати и број минута, затим, у следеђој линији време завршетка филма дато у
# истом облику и на крају један цео број који представља интервал у минутима у којем се приказује најава.
# Излаз: На стандардном излазу приказати, времена емитовања најаве у облику h:m, свако у засебном реду.
# Пример
# Улаз
# 12
# 0
# 13
# 23
# 15
# Излаз
# 12:0
# 12:15
# 12:30
# 12:45
# 13:0
# 13:15

# h1=int(input('sat pocetka filma '))
# m1=int(input('minut pocetka filma '))
# h2=int(input('vreme zavrsetka filma '))
# m2=int(input('minut zavrsetka filma '))
# p=int(input('inerval najave '))

# i=h1

# while i<=h2:
#     if i==h1:
#         for q in range(m1,60,p):
#             print(i,':',q)
#     if i==h2:
#         for q in range(0,m2,p):
#             print(i,':',q)
#     i+=1

#bolje resenje
# pocetak = h1 * 60 + m1
# kraj = h2 * 60 + m2

# trenutak = pocetak
# while trenutak <= kraj:
#     print(trenutak // 60, ":", trenutak % 60)
#     trenutak += p
#===================================================================    
    
#===================================================================
#Zadatak  6
# Задатак: Подела интервала на једнаке делове
# Написати програм којим се исписују вредности n равномерно размакнутих реалних бројева из интервала
# [a, b], тако да је прва вредност a, а последња b.
# Улаз: Прва линија стандардног улаза садржи природан број n (1 < n ≤ 20), друга линија садржи реалан
# број a, а трећа линија реалан број b, при чему је a < b.
# Излаз: На стандардном излазу приказати редом тражене бројеве, заокружене на пет децимала, сваки у посебној линији.
# Пример
# Улаз
# 5
# -1
# 1
# Излаз
# -1.00000
# -0.50000
# 0.00000
# 0.50000
# 1.00000

# n=int(input('n'))
# a=int(input('pocetak '))
# b=int(input('kraj '))
# i=a
# x=(b-a)/(n-1)
# while i<=b:
#     print(format(i,'.5f'))
#     i+=x
#===================================================================    
    
#===================================================================
#Zadatak  7
# Задатак: Геометријска серија
# Написати програм који за дате природне бројеве a, b исписује бројеве из интервала [a, b], од којих је први
# број који се исписује једнак a, а сваки следећи је три пута већи од претходног. На пример, за [a, b] = [5, 50]
# треба исписати 5, 15, 45.
# Улаз: Са стандардног улаза се учитавају природни бројеви a (1 ≤ a ≤ 50) и b (a ≤ b ≤ 10000 ) сваки у
# посебном реду.
# Излаз: На стандардном излазу исписују се сви тражени бројеви, редом (од најмањег до највећег). Сваки
# број исписати у посебној линији.
# Пример
# Улаз
# 5
# 50
# Излаз
# 5
# 15
# 45

# a=int(input('pocetak intervala '))
# b=int(input('kraj intervala '))
# i=a
# while i<=b:
#     print(i)
#     i=i*3
#===================================================================    
    
#===================================================================
#Zadatak  8
# Задатак: Збир n бројева
# Написати програм којим се одређује збир n датих целих бројева.
# Улаз: У првој линији стандардног улаза налази се природан број n (1 ≤ n ≤ 1000). У свакој од наредних n
# линија налази се по један цео број xi
# .
# Излаз: У првој линији стандарног излаза приказати збир унетих n целих бројева x1, . . . , xn.
# Пример
# Улаз
# 4
# 10
# -3
# 2
# 4
# Излаз
# 13

# n=list(map(int,input('unesite brojeve ').split()))
#n.pop(0)
# print(sum(n))
# brojevi=[]
# n=int(input('koliko brojeva hoces upisati '))
# for i in range(n):
#     brojevi.append(int(input('broj koji zelis ubaciti')))
# print(sum(brojevi))
#===================================================================   
    
#===================================================================
#Zadatak  9
# Задатак: Читање до нуле
# Уносе се цели бројеви док се не унесе нула. Написати програм којим се приказује колико је унето бројева,
# не рачунајући нулу.
# Улаз: Свака линија стандардног улаза, изузев последње, садржи цео број различит од нуле. Последња линија
# садржи нулу.
# Излаз: На стандардном излазу у првој линији приказати колко је учитано бројева, не рачунајући нулу.
# Пример 1
# Улаз
# 5
# -675
# 123
# 0
# Излаз
# 3
# Пример 2
# Улаз
# 0
# Излаз
# 0

# i=0
# while True:
#     broj=int(input('unesi neki broj '))
#     if broj==0:
#         break 
#     i+=1
# print(i)
#===================================================================
    
#===================================================================
#Zadatak  10
# Задатак: Читање до краја улаза
# Са улаза се уносе цели бројеви све док се не дође до краја улаза. Написати програм којим се приказује колико
# је унето бројева.
# Улаз: Свака линија стандардног улаза садржи по један цео број. НАПОМЕНА: приликом интерактивног
# тестирања програма, крај стандардног улаза се означава комбинацијом тастера ctrl + z ако се користи
# оперативни систем Windows тј. ctrl + d aко се користи оперативни систем Linux.
# Излаз: У првој линији стандардног излаза приказати колико је бројева унето.
# Пример
# Улаз
# 20
# 145
# -23
# -12
# Излаз
# 4

# brojevi=list(map(int,input('brojevi ').split()))
# print(len(brojevi))
# import sys
# broj = 0
# for linija in sys.stdin:
#     broj = broj + 1
# print(broj)
#===================================================================    
    
    
#===================================================================
#Zadatak  11
# Задатак: Читање до -1 или до n-тог броја
# Пера се током часа играо и сецкао квадрате од папира. Учитељица је то приметила и дала му је задатак да
# израчуна укупну површину свих квадрата које је исекао. Напиши програм који Пери помаже да то уради.
# Пера, на самом почетку уноси број n за који је сигуран да је већи или једнак броју квадратића. Након
# тога, уноси највише n бројева који представљају дужине страница квадратића, при чему, ако примети да
# квадратића има мање од броја n, он уноси −1, чиме означава да је потребно прекинути унос.
# Улаз: Са стандардног улаза се учитава број n (0 ≤ n ≤ 15), а затим m (1 ≤ m ≤ n) целих бројева између 1
# и 10, при чему, ако је m < n, онда се након њих уноси −1.
# Излаз: На стандардни излаз исписати један цео број који представља укупну површину свих квадрата.
# Пример 1
# Улаз
# 3
# 1
# 2
# 3
# Излаз
# 14
# Пример 2
# Улаз
# 5
# 1
# 2
# 3
# -1
# Излаз
# 14
# n=int(input('maksimalan broj stranica: '))
# povrsine=0
# while n>0:
#     broj=int(input('stranica '))
#     if broj==-1:
#         break
#     povrsine+=broj*broj 
#     n-=1
# print(povrsine) 
#===================================================================    
    
#===================================================================
#Zadatak  12
# Задатак: Прерачунавање миља у километре
# Миља је енглеска историјска мера за дужину која износи 1609.344 m. Напиши програм који исписује таблицу
# прерачунавања миља у километре.
# Улаз: Са стандардног улаза се уносе цели бројеви a (1 ≤ a ≤ 10), b (10 ≤ b ≤ 100) и k (1 ≤ k ≤ 10).
# Излаз: На стандардни излаз исписати табелу конверзије миља у километре за сваки број миља из интервала
# [a, b], са кораком k. Број километара заокружити на 6 децимала, а табелу приказати у формату идентичном
# као у примеру.
# Пример
# Улаз
# 10
# 20
# 2
# Излаз
# 10 mi = 16.093440 km
# 12 mi = 19.312128 km
# 14 mi = 22.530816 km
# 16 mi = 25.749504 km
# 18 mi = 28.968192 km
# 20 mi = 32.186880 km

# a=int(input('pocetak intervala milje '))
# b=int(input('kraj intervala milje '))
# k=int(input('korak '))
# for km in range(a,b+1,k):
#     izraz=km*1.609344 
#     print(km,' mi = ',format(izraz,'.6f'),' km')
#=================================================================== 
    
#===================================================================
#Zadatak  13
# Задатак: Табелирање функције
# Аутомобил се креће равномерно убрзано са почетном брзином v0 (израженом у m
# s
# ) и убрзањем a (израженим
# у
# m
# s
# 2 ). Укупно време до постизања максималне брзине је T секунди. На сваких ∆t секунди од почетка потребно је израчунати пређени пут аутомобила. Напомена: за равномерно убрзано кретање пређени пут након
# протеклог времена t изражава се са s = v0 · t +
# a·t
# 2
# 2
# .
# Улаз: Са стандардног улаза учитавају се 4 реална броја (сваки је у посебном реду):
# • v0 (0 ≤ v0 ≤ 5) - почетна брзина
# • a (1 ≤ a ≤ 3) - убрзање
# • T (5 ≤ T ≤ 10) - укупно време
# • ∆t (0.1 ≤ ∆t ≤ 2.5) - интервал
# Излаз: На стадардни излаз исписати серију бројева који представљају пређени пут у задатим тренуцима.
# Пример
# Улаз
# 1
# 1
# 2
# 0.5
# Излаз
# 0.00000
# 0.62500
# 1.50000
# 2.62500
# 4.00000

# v0=float(input('pocetna brzina auta '))
# a=float(input('ubrzanje auta '))
# T=float(input('ukupno vreme do dostizanja maksimalne brzine '))
# t=float(input('intervali '))
# i=0
# while i<=T:
#     s=v0*i+(a*(i**2))/2 
#     print(format(s,'.6f'))
#     i=i+t
#=================================================================== 
    
#===================================================================
#Zadatak  14
# Задатак: Факторијел
# Дате су цифре 1, 2, . . . , n. Напиши програм који израчунава колико се различитих n-тоцифрених бројева
# састављених од свих тих цифара може направити (на пример, од цифара 1, 2, 3 могу се направити бројеви
# 123, 132, 213, 231, 312 и 321).
# 133
# ГЛАВА 4. ИТЕРАЦИЈА
# Напомена: Број пермутација скупа од n елемената једнак је факторијелу броја n тј. броју n! = 1 · 2 · . . . · n.
# Размисли зашто је баш тако.
# Улаз: Прва линија стандарног улаза садржи природан број n (1 ≤ n ≤ 9).
# Излаз: У првој линији стандарног излаза приказати број различитих бројева који се могу направити од
# цифара 1, 2, . . . , n.
# Пример 1
# Улаз
# 5
# Излаз
# 120
# Пример 2
# Улаз
# 9
# Излаз
# 362880

# broj=int(input('broj za faktorisanje '))
# resenje=1
# while broj>0:
#     resenje*=broj 
#     broj-=1 
#     print(resenje)
# print(resenje)
#===================================================================
    
 
#===================================================================
#Zadatak  15
#Задатак: Степен
# Напиши програм који израчунава степен x
# n. Покушај да програм напишеш без употребе библиотечких функција и оператора за степеновање.
# Улаз: Са стандардног улаза се уноси реалан број x (0.8 ≤ x ≤ 1.2) и цео број n (0 ≤ n ≤ 20).
# Излаз: На стандардни излаз испиши вредност x
# n заокружену на пет децимала.
# Пример
# Улаз
# 1.1
# 5
# Излаз
# 1.6105

# x=float(input('broj za stepenovanje '))
# n=int(input('stepen '))
# resenje=1
# while n>0:
#     resenje=resenje*x
#     n-=1 
# print(format(resenje,'.5f'))
#===================================================================   
 
    
#===================================================================
#Zadatak  16
# Задатак: Просек свих бројева до краја улаза
# Са стандардног улаза се учитава број поена такмичара на такмичењу из програмирања. Напиши програм
# који израчунава просечан број поена свих такмичара.
# Улаз: Сваки ред стандардног улаза садржи један цео број између 0 и 100. НАПОМЕНА: приликом интерактивног тестирања програма, крај стандардног улаза се означава комбинацијом тастера ctrl + z ако се
# користи оперативни систем Windows тј. ctrl + d aко се користи оперативни систем Linux.
# Излаз: На стандардни излаз исписати просек заокружен на 5 децимала.
# Пример
# Улаз
# 1
# 2
# 3
# 4
# Излаз
# 2.50000
# niska=[]
# try:
#     while True:
#         niska.append(int(input('unesite broj')))
# except:
#      print(sum(niska)/len(niska))
#===================================================================
    
#===================================================================
#Zadatak  17
# Задатак: Средине
# Aутомобил путује мењајући брзину током путовања. Познато је да се један део пута кретао равномерно
# брзином v1
# km
# h
# , затим се један део пута кретао равномерно брзином v2
# km
# h
# , и тако даље, све до последњег
# дела пута где се кретао равномерно брзином од vn
# km
# h
# . Написати програм који одређује просечну брзину
# аутомобила на том путу и то:
# • ако се претпостави да је сваки део пута трајао исто време,
# • ако се претпостави да је на сваком делу пута аутомобил прешао исто растојање.
# Улаз: Са стандардног улаза уноси се n (2 ≤ n ≤ 10) позитивних реалних бројева: v1, v2, …, vn (za svako vi
# важи 30 ≤ vi ≤ 120), након чега следи крај улаза.
# Излаз: У првој линији стандардног излаза исписати реалан број заокружен на 2 децимале који представља
# просечну брзину под претпоставком да је сваки део пута трајао исто време, а у другом реду реалан број
# заокружен на 2 децимале који представља просечну брзину под претпоставком да је на сваком делу пута
# аутомобил прешао исто растојање.
# Пример
# Улаз
# 60
# 40
# Излаз
# 50.00
# 48.00

# brzine=[]
# while len(brzine)<=10:
#     try:
    
#         brzine.append(int(input('brzina ')))
#     except:
#         break

# arit=sum(brzine)/len(brzine)
# harmonija=[1/v for v in brzine]
# harm=len(brzine)/sum(harmonija)
# print(f'{arit:.2f}')
# print(f'{harm:.2f}')
#===================================================================
    
#===================================================================
#Zadatak  18
# Задатак: Просечан раст цена
# Потрошачка корпа је коштала 60000 динара. Након годину дана цене су порасле 21 проценат и потрошачка
# корпа је коштала 72600 динара. Након друге године цене су порасле још 44 процента и потрошачка корпа је
# коштала 104544 динара. Поставља се питање колико је просечно годишње порасла цена потрошачке корпе.
# Дефинишимо да ће просечан проценат пораста цене бити онај који, када се примени након сваке године,
# на крају дати исту цену као и у случају полазних пораста цена. У нашем примеру, ако би цена порасла 32
# процента након годину дана потрошачка корпа би коштала 79200 динара, и ако би након друге године порасла
# 136
# 4.2. ОСНОВНИ АЛГОРИТМИ НАД СЕРИЈАМА ЕЛЕМЕНАТА
# још 32 процента, на крају би коштала поново тачно 104544 динара, тако да кажемо да је просечан пораст цене
# 32 процента. Напиши програм који за дате појединачне проценте пораста цене након сваке године израчунава
# просечан проценат пораста цене током целог периода.
# Улаз: Са стандардног улаза се уноси број n (важи 2 ≤ n ≤ 10) а затим n реалних бројева p1, p2, . . . , pn који
# представљају проценте раста цене на крају сваке године (за свако pi важи да је 5 ≤ pi ≤ 50).
# Излаз: На стандардни излаз приказати један реалан број заокружен на две децимале који представља просечан проценат пораста цене.
# Пример 1
# Улаз
# 2
# 21
# 44
# Излаз
# 32.00
# Пример 2
# Улаз
# 5
# 47.0
# 13.0
# 13.5
# 26.5
# 16.5
# Излаз
# 22.68

n=int(input('koliko ima porasta cena '))
ukupno=0
i=0
while n>0:
    cena=float(input('prosecan broj cena '))
    ukupno+=cena
    i+=1 
    n-=1 
print(format(ukupno/i,'.1f'))    





#===================================================================






    
 
    
 
    
    
    
    
    