# -*- coding: utf-8 -*-
"""
Spyder Editor

This is a temporary script file.
"""

#Основи програмирања: вежбе - I недеља

#treci zadatak
#Написати функциjу коjа врши конверзију величине угла из степена у радијане, уз ограничење резултата на одређени број децимала.
# =============================================================================
# from math import pi
# def konvertor(ugao):
#     radijani=ugao*pi/180
#     return round(radijani)
# =============================================================================


# =============================================================================
# Задатак 4
# Написати функцију која претвара време задато у минутима у време изражено у сатима и минутима.


# def minusat(minuti):
#     sati=minuti//60
#     minut= minuti%60
#     return print(sati, "h", minut,"min")
# =============================================================================


# =============================================================================
# Задатак 5
# Написати функциjу коjа врши израчунавање обима круга на основу његове површине.


# from math import pi, sqrt 
# def povrsina(P):
#     #povrsina je r^2*pi, obim je 2rp
#     r= sqrt(P/pi)
#     O=2*r*pi
#     return print("Obim je",O)
# =============================================================================



# =============================================================================
# Задатак 6
# Написати функциjу коjа врши израчунавање Еуклидкског растојања између две тачке унутар исте равни. Користити следећу формулу:

# from math import sqrt
# def rastojanje(x1,x2,y1,y2):
#     return sqrt((x1-x2)**2+(y1-y2)**2)
# =============================================================================


# =============================================================================
# Задатак 7
# Написати функцију која израчунава површину једнакостраничног троугла на основу његовог обима.

# from math import sqrt
# def obim(O):
#     a=O/3
#     return a**2*sqrt(3)/4
# =============================================================================


# =============================================================================
# Задатак 8
# Написати функцију који враћа збир цифара четвороцифреног броја.

# def cifre(x):
#     prvac=x%10  #daje ostatak sa brojem 10, a to ce uvek biti poslednja cifra
#     drugac=(x//10)%10   #deli sa 10 i uzima ostatak sa ostatkom tog deljenja
#     trecac=(x//100)%10
#     cetvrtac=(x//1000)%10
#     return prvac+drugac+trecac+cetvrtac
# =============================================================================


# =============================================================================
# Задатак 9
# Написати функцију која враћа аритметичку средину цифара четвороцифреног броја унетог путем стандардног улаза.
#aritmeticka sredina je zbir cifara broja i podeljen sa brojem cifra
# def aritmetsr():
#     print("Unesite cetvorocifreni broj: ")
#     x=int(input())
#     prvac=x%10  
#     drugac=(x//10)%10 
#     trecac=(x//100)%10
#     cetvrtac=x//1000
#     return (prvac+drugac+trecac+cetvrtac)/4
# =============================================================================


# =============================================================================
# Задатак 10
# Написати функцију која враћа геометријску средину цифара четвороцифреног броја унетог путем стандардног улаза. Омогућити заокруживање резултата на произвољан број децимала.
#Slicno kao prethodni, samo sto imamo dva inputa i geometrijska sredina je mnozenje unutar korena
# def geometrijskasr():
#     x=int(input("Unesti cetvorocifreni broj"))
#     prvac=x%10
#     drugac=(x//10)%10
#     trecac=(x//100)%10
#     cetvrac=x//1000
#     geomet=(prvac+drugac+trecac+cetvrac)**(1/4)
#     print("Unesti na koliko brojeva zelis da zaokruzis: ")
#     decim=int(input())
#     return round(geomet, decim)
# =============================================================================











