#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Wed Mar 12 10:37:11 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    

#===================================================================
#Zadatak  1
# Спортиста се на почетку тренинга загрева тако што трчи по ивицама правоугаоног терена дужине d и ширине
# s. Написати програм којим се одређује колико метара претрчи спортиста док једном обиђе терен.
# Улаз: У првој линији стандардног улаза се налази целобројна вредност d (0 < d ≤ 100), а у следећој линији
# целобројна вредност s (0 < s ≤ 100) које редом представљају дужину и ширину терена изражену у метрима.
# Излаз: Цео број метара које претрчи спортиста док једном обиђе терен.
# Пример
# Улаз
# 50
# 25
# Излаз
# 150

# def krug(d,s):
#     return 2*d+2*s
#===================================================================


#===================================================================
#Zadatak  2
# Задатак: Лист папира
# Написати програм који на основу задате ширине и висине листа папира (правоугаоног облика) у милиметрима
# одређује његову површину у квадратним милиметрима.
# Улаз: У једној линији стандардног улаза налазе се две целобројне вредности V и S (0 < V ≤ 300, 0 < S ≤
# 300) које представљају ширину и висину листа папира изражену у милиметрима.
# Излаз: Један цео број који представља површину листа у квадратним милиметрима
# Пример
# Улаз
# 279 216
# Излаз
# 60264

# def povrsina(sirina, visina):
#     return (sirina*visina)
#===================================================================


#===================================================================
#Zadatak  3
# Задатак: Столњак
# Написати програм којим се израчунава потребна дужина траке за поруб столњака кружног облика чија је
# површина P.
# Улаз: У линији стандардног улаза се налази реална вредност P (1 ≤ P ≤ 1000).
# Излаз: Потребна дужина траке (реалан број заокружен на две децимале).
# Пример
# Улаз
# 7853.982
# Излаз
# 314.16

# p=float(input("Povrsina kruznog stolnjaka: "))
# from math import pi, sqrt
# r=sqrt(p/pi)
# o=2*r*pi
# print(format(o, '.2f'))
#===================================================================



#===================================================================
#Zadatak  4
# Задатак: Фудбалски терен
# Фудбалски терен димензија d×s треба оградити правоугаоном оградом тако да је растојање страница ограде
# од линије терена r. Напиши програм који одређује дужину ограде.
# Улаз: У три реда стандардног улаза налазе се три цела броја:
# • d - дужина терена у метрима (90 ≤ d ≤ 120)
# • s - ширина терена у метрима (45 ≤ s ≤ 90)
# • r - растојање ограде од терена у метрима (2 ≤ r ≤ 10)
# Излаз: Дужина ограде у метрима.
# Пример
# Улаз
# 100
# 60
# 3
# Излаз
# 344

# d=int(input("Duzina terena je: "))
# s=int(input("Sirina terena je: "))
# r=int(input("Rastojanje od ograde do terena: "))
# ograda=2*(d+s+4*r)
# print(ograda)
#===================================================================



#===================================================================
#Zadatak  5

# Задатак: Растојање тачака
# Напиши програм који израчунава и исписује растојање између тачака задатих својим координатама.
# Улаз: Са стандардног улаза уносе се четири реална броја, сваки у посебном реду. Прва два броја Ax и Ay
# представљају координате тачке A = (Ax, Ay), док друга два броја Bx и By представљају координате тачке
# B = (Bx, By).
# Излаз: На стандардни излаз исписати један реалан број који представља растојање између тачака A и B,
# заокружен на пет децимала.
# Пример
# Улаз
# 0
# 0
# 1
# 1
# Излаз
# 1.41421
# import math
# Ax,Ay=float(input("Ax= ")), float(input("Ay= "))        
# Bx, By=float(input("Bx= ")), float(input("By= "))

# r=math.sqrt((Ax-Bx)**2+(Ay-By)**2) #ovo je pitagorina teorema, posto nemamo stranicu a imamo koordinate
# print(format(r,'.5f'))
#===================================================================



#===================================================================
#Zadatak  6
# Задатак: Површина троугла датих темена
# Напиши програм који израчунава површину троугла ако су познате координате његових темена.
# Улаз: Са стандардног улаза уноси се 6 реалних бројева (сваки у засебном реду). Прва два представљају x и
# y координату темена A, друга два x и y координату темена B и последња два представљају x и y координату
# темена C.
# Излаз: На стандардни излаз исписати један реалан број који представља површину троугла (допуштена грешка израчунавања је 10−5
# ).
# Пример
# Улаз
# 0
# 0
# 0
# 1
# 1
# 0
# Излаз
# 0.5

# from math import sqrt
# Ax, Ay=float(input("Ax= ")), float(input("Ay= "))
# Bx, By= float(input("Bx= ")), float(input("By= "))
# Cx, Cy= float(input("Cx= ")), float(input("Cy= "))
# def rastojanje(x1,y1,x2,y2):   #rastojanje od x1,y1 do x2,y2
#     return sqrt((x2-x1)**2+(y2-y1)**2)
# def povrsina(a,b,c):
#     s=(a+b+c)/2 
#     return sqrt(s*(s-a)*(s-b)*(s-c))
# a=rastojanje(Bx, By, Cx, Cy)
# b=rastojanje(Ax,Ay,Cx,Cy)
# c=rastojanje(Ax,Ay,Bx,By)
# P=povrsina(a, b, c)
# print(format(P, '.5f'))  #ide format jer su dozvoljene granice do 10^-5  
#===================================================================



#===================================================================
#Zadatak  7                                                                      zajeban(chatgpy carry)
# Задатак: Ниво базена
# Током олује пало је n литара воде по квадратном метру. Написати програм којим се одређује за колико
# центиметара се подигао ниво воде у отвореном базену датих димензија, ако знамо да се вода није прелила
# преко базена.
# Улаз: У првој линији стандарндог улаза налази се реалан број n који представља количину кише која је
# пала по квадратном метру изражену у литрима. У следеће три линије налазе се реални бројеви a, b, c који
# представљају димензије базена изражене у метрима и то редом дужину, ширину и дубину.
# Излаз: На стандарном излазу приказати један реалан број на две децимале који представља за колико центиметара се подигао ниво воде у базену.
# Пример
# Улаз
# 75.5
# 4
# 7
# 1.7
# Излаз
# 7.55

# n=float(input("Kolicina vode koja je pala u bazenu izrazena u litrima: "))
# a=float(input("Duzina bazena: "))
# b=float(input("Sirina bazena: "))
# c=float(input("Dubina bazena: "))
# #1 litar vode zauzima 1 kubni decimetar, kisa pada na povrsinu basena a*b i koliko kise je n, to ce biti zapremina
# V=(a*b*n)/1000 #delimo sa hiljadu jer je 1l= 0.0001 dm^3
# h=V/(a*b)
# hcm=h*100  #trazi se u cm
# print(round(hcm,2))
#===================================================================



#===================================================================
#Zadatak  8
# Задатак: Правоугаоник дат наспрамним теменима
# Дате су координате два наспрамна темена правоугаоника чије су странице паралелне координатним осама.
# Написати програм којим се приказују дужина дијагонале одређене тим теменима, обим и површина тог правоугаоника.
# Улаз: Са стандардног улаза учитавају се 4 цела броја из интервала [−1000, 1000], сваки у посебној линији.
# Учитани бројеви представљају редом x и y координату два наспрамна темена правоугаоника.
# Излаз: На стандардном излазу приказати дужину дијагоналe правоугаоника, заокружену на две децимале,
# обим и површину датог правоугаоника. Сваки податак приказати у посебној линији.
# Пример
# Улаз
# 5
# -1
# -3
# 6
# Излаз
# 10.63
# 30
# 56

# from math import sqrt
# x1,y1=int(input("x1= ")), int(input("y2= "))
# x2, y2=int(input("x2= ")), int(input("y2="))
# duzina=abs(x2-x1)       #ispadalo mi je netacno jer nisam bio stavio abs
# sirina=abs(y2-y1)
# d=abs(sqrt(duzina**2+sirina**2))
# print(format(d,'.2f'))
# print(abs(duzina*sirina))
# print(abs((2*duzina)+(2*sirina)))
#===================================================================



#===================================================================
#Zadatak  9
# Задатак: Троугао одређен правом и координатним почетком
# Одреди површину и обим троугла којег права y = a · x + b (a, b ̸= 0), задата коефицијентима a и b, образује
# са координатним осама.
# Улаз: Два реална броја различита од 0. У првој линији a, а у другој b.
# Излаз: Приказати у првој линији површину троугла, а у другој обим, заокружене на две децимале.
# Пример
# Улаз
# 2.5
# 3.0
# Излаз
# 1.80
# 7.43

# from math import sqrt
# a=float(input("a= "))
# b=float(input("b= "))

# px= -b/a #presek sa x osom
# py=b #presek sa y osom
# visina=abs(py)
# duzina=abs(px)
# hipotenuza=sqrt((visina**2)+(duzina**2))

# povrsina=(1/2)*visina*duzina
# obim=visina+duzina+hipotenuza
# print(format(povrsina,'.2f'))
# print(format(obim, '.2f'))
#===================================================================



#===================================================================
#Zadatak  10
# Задатак: Oграда терасе
# На тераси дужине d метара треба распоредити n стубића ширине s центиметара тако да растојање између
# стубића, као и између стубића и зида буде исто.
# Слика 2.2: Ограда терасе
# Улаз: Три реда стандардног улаза садрже три броја:
# • d - реалан број који представља дужину терасе у m (1 ≤ d ≤ 20)
# • n - цео број стубића (1 ≤ n ≤ 100)
# • s - реалан број који представља ширину стубића у cm (5 ≤ s ≤ 15)
# Излаз: Растојање између стубића у центиметрима, заокружено на две децимале.
# Пример
# Улаз
# 10
# 30
# 10
# Излаз
# 22.58

#matematicki ga resavamo, n*s + (n+1)*r=d*100 jer je d u m koristi brainz
# d=float(input("Duzina terase u metrima "))
# n=float(input("broj stubica "))
# s=float(input("sirina stubica u cm "))
# r=(d*100-n*s)/(n+1)
# print(format(r,'.2f'))
#===================================================================



#===================================================================
#Zadatak  11
# Задатак: Збирови по три странице правоугаоника
# Ако је збир неке три странице правоугаоника m, а збир неке друге три странице истог правоугаоника n,
# написати програм којим се одређује обим и површина тог правоугаоника.
# Улаз: Прва линија стандарног улаза садржи реалан број m који представља збир неке три странице правоугаоника, 
#друга линија садржи реалан број n који представља збир неке друге три странице правоугаоника.
# Излаз: У првој линији стандарног излаза приказати на две децимале обим правоугаоника, а у другој линији
# површину правоугаоника такође на две децимале.
# Пример
# Улаз
# 8
# 10
# Излаз
# 12.00
# 8.00

# m=float(input("m: "))
# n=float(input("n: "))
# a=(2*m-n)/3 
# b=(2*n-m)/3
# p=a*b
# o=2*a+b*2 
# print(round(o,3))
# print(round(p,3))
#===================================================================



#===================================================================
#Zadatak  12
# Задатак: Просек на такмичењу
# На такмичењу из математике учествовало је N ученика. Извештај о броју поена одштампан је на две стране.
# Наставник грешком није понео прву страну извештаја, али се сећа да је на дну стране писало да је просечан
# број поена за ту страну био p1. На другој страни (коју има код себе) су подаци о K ученика и просечан број
# поена за ту страну је p2. Написати програм којим се одређује колики је просечан број поена свих ученика.
# Улаз: На стандардном улазу налазе се
# • у првој линији природан број N укупна број ученика (N ≤ 200)
# • у другој линији природан број K број ученика на другој страни (K ≤ 100)
# • у трећој линији реалан број p1 просечан број поена ученика на првој страни (0 ≤ p1 ≤ 100)
# • у четвртој линији реалан број p2 просечан број поена ученика на другој страни (0 ≤ p2 ≤ 100)
# Излаз: На стандарном излазу приказати, на две децимале, просечан број свих ученика.
# Пример
# Улаз
# 80
# 30
# 78.20
# 89.30
# Излаз
# 82.36

# N=int(input("Ukupan broj ucenika: "))
# k2=int(input("Ukupan broj ucenika na drugoj strani: "))
# p1=float(input("Prosecan broj poena na prvoj str: "))
# p2=float(input("Prosecan broj poena na drugoj str: "))

# k1=N-k2

# br1=k1*p1
# br2=k2*p2
# ukupno=(br1+br2)/N
# print(format(ukupno, '.2f'))
#===================================================================


