#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue May 20 19:18:49 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
#Написати функцију за поравнавање низа. Улазни низ може бити празан, а може садржати и ма коjи други 
#тип података укључуjући и низове коjи такође могу садржати низове до произвољне дубине.
def rek(niz):
    if niz==[]:
        return niz 
    elif type(niz[0])==list:
        return rek(niz[0]+ niz[1:]) 
    else: 
        return niz[:1] + rek(niz[1:])
#===================================================================    
    
    
#===================================================================
#Zadatak  2                   tehnici uradio sam ga sam ispravno
#Написати функцију коjа прима низ произвољно дубоко угнежђених низова броjевних вредности и задати броj,
# а враћа колико се укупно пута таj броj поjављуjе у улазном низу на произвољноj дубини.
def ponavljanje(niz, broj):
    if isinstance(niz, int):
        return 1 if niz == broj else 0
    
    if not niz:  # prazna lista
        return 0
    
    # Obrada prvog elementa i ostatka liste
    return ponavljanje(niz[0], broj) + ponavljanje(niz[1:], broj)
#===================================================================    
    
#===================================================================
#Zadatak  3






#===================================================================    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    