#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue Mar 18 22:20:24 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
#Написати функцију којом се четвороцифрени број учитава са стандардног улаза, а која враћа збир његових цифара.
# def cetfr():
#     x=input("Cetvorocifreni broj: ").strip()
#     j=int(x[-1])
#     k=int(x[-2])
#     l=int(x[-3])
#     h=int(x[-4])
#     ukupno=j+k+l+h    
#     print(ukupno)
#===================================================================



#===================================================================
#Zadatak  2
#Написати функцију који враћа унети број, али са избаченом цифром стотина.
# def izbacena():
#     broj=input("broj: ")
#     print(broj[:-3]+ broj[-2:])    
#===================================================================



#===================================================================
#Zadatak  3
#Написати програм који на стандардни излаз исписује број који се добија када се обрне редослед последње 4 цифре броја n.
# def obrni():
#     broj=input("Neki broj")
#     pre=broj[:-4]
#     posle=broj[:-5:-1]
#     print(pre+posle)
#===================================================================



#===================================================================
#Zadatak  4
#Написати функцију која за унете дужине страница троугла проверава да ли такав троугао постоји.
# def stranice():
#     a,b,c= map(float, input("A,b, i c: ").split())
#     if a<b+c and b<a+c and c<b+a:
#         return print("Trougao stranicama {},{},{} postoji".format(a,b,c))
#     else:
#         return print("Trougao sa stranicam"+ str(a)+","+str(b)+","+str(c)+" ne postoji")
#===================================================================



#===================================================================
#Zadatak  5
#Написати функцију која обавештава корисника о томе да ли је унети број паран или непаран.
# def parnost(a):
#     if a%2==0:
#         return print("{} je paran ):)".format(a))
#     else:
#         print("broj nije paran :(")
#===================================================================



#===================================================================
#Zadatak  6
# def deljivost(x):
#     if x%3==0:
#         print("vau {} je deljiv sa tri!!".format(x))
#     else:
#         print("broj nije deljiv sa tri, ostatak je: ",x%3)
#===================================================================



#===================================================================
#Zadatak  7
#Написати функцију која за за унети број проверава дељивост са 2 и са 3.
# def deljivost2(x):
#     if x%2==0:
#         print("{} je deljiv sa dva i ".format(x))
#     else:
#         print("broj nije deljiv sa dva ali")
#     if x%3==0:
#         print("deljiv je sa 3")
#     else:
#         print("nije deljiv sa 3")
#===================================================================




#===================================================================
#Zadatak  8
#Написати програм који за унете целе бројеве n, m, и k израчунава насумичан број z из интервала [n,m] а који је дељив са k.
# def zbr(n,m,k):
#     i=m-n
#     while i>0:
#         n+=1
#         if n%k==0:
#             print("{} je deljiv sa {}".format(n,k))
#             break
#         i-=1
#===================================================================



#===================================================================
#Zadatak  9
#Написати програм који за унети целобројни број враћа збир његових цифара, користити while петљу.
# def cifre(x):
    
#     zbir=0
#     while x>0:
#         cifra=x%10
#         zbir+=cifra
#         x=x//10
#     return print("Zbir je: ", zbir)
#===================================================================



#===================================================================
#Zadatak  10
#Написати програм који за унету ниску враћа ниску уназад.
# niska=input("Sta zelite da bude unazaceno ")
# aksin=niska[::-1]
# print(aksin)
#===================================================================



#===================================================================
#Zadatak  11
#Написати функцију која проверава да ли је унета ниска палиндром.
# def palindrom():
#     niska=input("Sta zelite da bude provereno: ")
#     return niska==niska[::-1]
#===================================================================



#===================================================================
#Zadatak  12
# Написати функцију која реч “тачно” преводи у објекат True, реч “нетачно” у објекат False, док за сваки други унос обавештава корисника да такав унос није валидан.
# def tacnost():
#     objekat=input("Da li je objekat tacan ili netacan ")
#     if objekat=="tacno" :
#         objekat=True
#         print(objekat)
#     elif objekat=="netacno":
#         objekat=False
#         print(objekat)
#     else:
#         print("'обавештава корисника да такав унос није валидан' eto si cuo")
#===================================================================




#===================================================================
#Zadatak  13
#Написати програм који исписује оцену на основу освојених поена.
# poeni=int(input("Koliko poena si dobio: "))
# i=0
# while i<=100:
#     if i==poeni<50:
#         print("dobio si kecugu, ne cek PETICU")
#     elif i==poeni<60:
#         print("dobio si 6 bravo")
#     elif i==poeni<70:
#         print("bravo bre 7")
#     elif i==poeni<80:
#         print("bravo bre nigga 8")
#     elif i==poeni<90:
#         print("9")
#     elif i==poeni<101:
#         print("1 :) 0")
#     i+=1
#===================================================================



#===================================================================
#Zadatak  14
#Написати функцију која израчунава квадрат задатог целог броjа понављањем сабирања.
# def faktorijel(x):
#     fakt=1
#     while x>0:
#         fakt*=x
#         x-=1
#     return fakt

#===================================================================




#===================================================================
#Zadatak  15
#Написати функцију која израчунава квадрат задатог целог броjа понављањем сабирања.










#===================================================================
































