#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue Mar 18 22:20:24 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
#Написати функцију којом се четвороцифрени број учитава са стандардног улаза, а која враћа збир његових цифара.
# def cetfr():
#     x=input("Cetvorocifreni broj: ").strip()
#     j=int(x[-1])
#     k=int(x[-2])
#     l=int(x[-3])
#     h=int(x[-4])
#     ukupno=j+k+l+h    
#     print(ukupno)
#===================================================================



#===================================================================
#Zadatak  2
#Написати функцију који враћа унети број, али са избаченом цифром стотина.
# def izbacena():
#     broj=input("broj: ")
#     print(broj[:-3]+ broj[-2:])    
#===================================================================



#===================================================================
#Zadatak  3
#Написати програм који на стандардни излаз исписује број који се добија када се обрне редослед последње 4 цифре броја n.
def obrni():
    broj=input("Neki broj")
    pre=broj[:-4]
    posle=broj[:-5:-1]
    print(pre+posle)
#===================================================================























