#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Thu Mar 20 23:05:06 2025

@author: alex
"""

#===================================================================
#Zadatak  1
# Задатак: Генератор случајних бројева
# У рачунарству се често јавља потреба за генерисањем случајних (насумичних) бројева. Већина програмских
# језика обезбеђује функцију која враћа насумично одабран реалан број из интервала [0, 1) (тај број већи или
# једнак од 0, а строго мањи од 1), подразумевајући да програмер може накнадним аритметичким трансформацијама добити број из било ког интервала [a, b) (за који важи да је a < b). Напиши програм који за унети
# број x из интервала [0, 1) одређује њему одговарајући број из интервала [a, b), подразумевајући да се пресликавање врши линеарном функцијом (број који се тражи дели интервал [a, b) у истом односу у ком тачка
# x дели интервал [0, 1)).
# Улаз: Са стандардног улаза учитава се један реалан број x из интервала [0, 1) (број који је вратио генератор
# случајних бројева), затим, у наредном реду један реалан број a и онда у наредном реду број b (при том важи
# a < b).
# Излаз: На стандардни излаз исписати један реалан број из интервала [a, b) који се добија када се унети број
# x преслика линеарном функцијом која пресликава интервал [0, 1) на интервал [a, b). Резултат приказати
# заокружен на 5 децимала.

# x=float(input("x "))
# a=float(input("a "))
# b=float(input("b "))
# y=(b-a)*x + a
# print(format(y,'.5f'))
#===================================================================



#===================================================================
#Zadatak  2
# Задатак: Група радника
# Група коју чини n радника уради посао за s сати. Написати програм којим се одређује за колико сати ће
# посао бити завршен ако се прикључи још m радника, а сваки радник ради посао подједнако ефикасано.
# Улаз: У три линије стандардног улаза се редом налазе природан број n, реалан број s и природан број m.
# Излаз: Један рeалан број, заокружен на две децимале, који представља број сати потребних да се посао
# заврши када посао ради n + m радника.
# Пример
# Улаз
# 1
# 3
# 1
# Излаз
# 1.5

# n=int(input("Broj radnika "))
# s=float(input("broj sati uradjenih od strane broja tih radnika "))
# m=int(input("koliko jos radnika dolazi? "))
# s1=(s*+n)/(m+n)
# print(format(s1,'.2f'))
#===================================================================



#===================================================================
#Zadatak  3
# Задатак: Такси
# У такси су истовремено ушла три путника, али су излазили један по један. Договорили су се да у плаћању
# сваког дела вожње подједнако учествују путници који су у том делу вожње били у таксију. Ако се зна стање
# на таксиметру у динарима када је изашао свако од њих, колико треба да плати путник који је изашао први,
# колико други, а колико трећи?
# Улаз: Са стандардног улаза се учитавају три реална броја, у сваком реду по један, у следећем редоследу:
# • c1 - стање на таксиметру у моменту изласка првог путника,
# • c2 - стање на таксиметру у моменту изласка другог путника,
# • c3 - стање на таксиметру у моменту изласка трећег путника.
# При томе важи c1 < c2 < c3.
# Излаз: На стандардни излаз исписати три реална броја заокружена на две децимале (у сваком реду по један),
# који редом представљају трошкове путовања првог, другог и трећег путника.
# Пример
# Улаз
# 1200.0
# 1500.0
# 2000.0
# Излаз
# 400.00
# 550.00
# 1050.00

# c1=float(input("Sranje na taksimetru u momentu za prvog lika: "))
# c2=float(input("stanje u momentu za drugog lika: "))
# c3=float(input("stanje u momentu za treceg like: "))
# t1=c1/3 
# t2=c1/3 + (c2-c1)/2 
# t3=c1/3 + (c2-c1)/2 + (c3-c2)
# print(format(t1,'.2f'))
# print(format(t2,'.2f'))
# print(format(t3,'.2f'))
#===================================================================


























