#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Mar 31 19:25:50 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
#Написати функцију која, за унети низ, враћа индекс на којем је минимални члан.
def minimal(niz):
    mij=niz[0]
    indeks=1
    minindeks=0
    for i in niz:
        if mij>i:
           mij=niz[i]
           minindeks=indeks
        indeks+=1
    return minindeks
#===================================================================
    


#===================================================================
#Zadatak  2
#Написати функцију која, за унети низ, враћа индекс на којем је максимални члан.
def maks():
    niz=list(map(int,input('niz: ').split()))
    indeks=0
    malj=niz[0]
    for i in range(1,len(niz)):
        if niz[i]>malj:
            malj=niz[i]
            indeks=i
    return indeks
#===================================================================


#===================================================================
#Zadatak  3
#Написати функцију која враћа број из низа који је најближи броју x.
def najblizix(x,niz):
    najblizi=abs(x-niz[0])
    naj=0
    for i in niz:
        if abs(x-i)<najblizi:
            najblizi=abs(x-i)
            naj=i
    return naj

#===================================================================



#===================================================================
#Zadatak  4
#Написати функцију која, за унети стринг с, проверава да ли је стринг палиндром.
def palindrom(s):
    for i in range(len(s)//2):
        if s[i]!=s[-(i+1)]:
            print('nije palindrom') 
            return False 
    return print('palindrom je ')
#===================================================================



#===================================================================
#Zadatak  5
#Написати програм који за једно учитано слово исписује његов велики или мали пандан,
# у зависности од тога да ли је унето слово велико или мало.

def prebaci(s):
    if s.islower():
        print(s.upper())
    else:
        print(s.lower())
#===================================================================


#===================================================================
#Zadatak  6
# Написати програм који одређује остатак при дељењу броја А бројем Б без коришћења оператора /, // и %. Подразумевати да важи: А 
#  0 и Б 
#  0.                                      ja:85% chatgpt:15% pogresna logika kod while petlje
def ostatak(a,b):
    na=abs(a)
    
    while na>=abs(b):
        na=na-abs(b)
       
    return print(na if a>0 else -na)

#===================================================================





