#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Mar 31 19:25:50 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
#===================================================================
#Zadatak  1
#Написати функцију која, за унети низ, враћа индекс на којем је минимални члан.
def minimal(niz):
    mij=niz[0]
    indeks=1
    minindeks=0
    for i in niz:
        if mij>i:
           mij=niz[i]
           minindeks=indeks
        indeks+=1
    return minindeks
#===================================================================
    


#===================================================================
#Zadatak  2
#Написати функцију која, за унети низ, враћа индекс на којем је максимални члан.
def maks():
    niz=list(map(int,input('niz: ').split()))
    indeks=0
    malj=niz[0]
    for i in range(1,len(niz)):
        if niz[i]>malj:
            malj=niz[i]
            indeks=i
    return indeks
#===================================================================


#===================================================================
#Zadatak  3
#Написати функцију која враћа број из низа који је најближи броју x.
def najblizix(x,niz):
    najblizi=abs(x-niz[0])
    naj=0
    for i in niz:
        if abs(x-i)<najblizi:
            najblizi=abs(x-i)
            naj=i
    return naj

#===================================================================



#===================================================================
#Zadatak  4
#Написати функцију која, за унети стринг с, проверава да ли је стринг палиндром.
def palindrom(s):
    for i in range(len(s)//2):
        if s[i]!=s[-(i+1)]:
            print('nije palindrom') 
            return False 
    return print('palindrom je ')
#===================================================================



#===================================================================
#Zadatak  5
#Написати програм који за једно учитано слово исписује његов велики или мали пандан,
# у зависности од тога да ли је унето слово велико или мало.

def prebaci(s):
    if s.islower():
        print(s.upper())
    else:
        print(s.lower())
#===================================================================


#===================================================================
#Zadatak  6
# Написати програм који одређује остатак при дељењу броја А бројем Б без коришћења оператора /, // и %. Подразумевати да важи: А 
#  0 и Б 
#  0.                                      ja:85% chatgpt:15% pogresna logika kod while petlje
def ostatak(a,b):
    na=abs(a)
    
    while na>=abs(b):
        na=na-abs(b)
       
    return print(na if a>0 else -na)

#===================================================================



#===================================================================
#Zadatak  7
#Написати функцију која проналази највећи заједнички делилац два цела броја.
def nzd(a,b):
    broj=min(abs(a),abs(b))
    while broj>0:
        if a%broj==0 and b%broj==0:
            return broj
        broj=-1
    return 1
#===================================================================


#===================================================================
#Zadatak  8
#Написати програм коjи над унетим низом A извршава K десних ротациjа.
def rotacija(a,k):
    k=k%len(a)
    indeski=[i for i in range(len(a))]
    a=a[-k:] + a[:-k]
    indeski=indeski[-k:]+indeski[:-1]
    for i in range(len(a)):
        print("clan {} je sada na poziciji {}; a inicijalno je bio na poziciji {}.\n".format(a[i],i,indeski[i]))
#===================================================================



#===================================================================
#Zadatak  9
#Spojler
#На твоју адресу стигла је мистериозна порука од непознатог пошиљаоца. Оно што је посебно необично јесте да је порука послата почетком 2023. године, а ова порука стиже средином децембра 2022. године. Отворивши поруку, видиш да је у прилогу видео запис финала светског првенства у фудбалу, које ће тек бити одиграно, и учествоваће репрезентације Аргентине и Француске. Порука такође садржи и "спојлован" коначан резултат утакмице. Ипак, одлучујеш да погледаш овај необичан видео запис из будућности.
# Опис улаза
# У првом реду стандардног улаза се налазе два природна броја 
# a
#  и 
# b
#  (спојлован резултат), док се у другом реду стандардног улаза налазе два природна броја 
# x
#  и 
# y
#  (резултат на полувремену).

# Опис излаза
# У једином реду стандардног излаза исписати:

# prvi уколико је могуће закључити да ће први тим (описан бројевима 
# a
#  и 
# x
# ) дати следећи гол
# drugi уколико је могуће закључити да ће други тим (описан бројевима 
# b
#  и 
# y
# ) дати следећи гол
# nijedan уколико је могуће закључити да у наставку утакмице неће бити више ниједног гола
# ? уколико није могуће једнозначно закључити који тим ће постићи наредни гол

# a,b=map(int,input("buduce resenje argentine i sta znam slovenije ").split())
# x,y=map(int,input("trenutno resenje argentine i francuske: ").split())

# if a==x and b==y:
#     print("nijedan")
# elif b==y and a>x:
#     print('prvi')
# elif a==x and b>y:
#     print('drugi')
# else:
#     print('?')
#===================================================================




#===================================================================
#Zadatak  10
# За задати цео број 
# n
# , написати програм који из броја изоставља узастопне понављајуће цифре и исписује новодобијени број.

# Улазни подаци
# У првом реду стандардног улаза дат је цео број 
# n
#  из поставке задатка.

# Излазни подаци
# У првом и једином реду стандардног излаза треба исписати број без узастопних понављајућих цифара.

# Пример 1
# Улаз
# 1299888833
# Излаз
# 12983

n=input()
broj=n[0]
for cifra in n[1:]:
    if cifra  != broj[-1]:
        broj=broj+cifra
print(int(broj))
#===================================================================






















