#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Fri May 16 16:34:02 2025

@author: alex
"""

def ispisati(x):
    print("#===================================================================")
    print("#Zadatak ", x)
    
    
    print("#===================================================================")
    
    
#izbrisala mi se prethodna dva
#===================================================================
#Zadatak  3
# Задатак: Мали лото
# У једном одељењу су одлучили да у склопу новогодишње приредбе организују мало извлачење игре лото. Да
# би повећали шансе за добитак, одлучили су да се извлаче само три куглице. Напиши програм који исписује које све комбинације могу бити извучене, ако се зна да у бубњу има n различитих куглица обележених
# бројевима од 1 до n.
# Улаз: Са стандардног улаза се уноси број n (4 ≤ n ≤ 20).
# Излаз: На стандардни излаз испиши све комбинације, при чему су бројеви у свакој комбинацији сортирани
# растуће, а комбинације су лексикографски сортиране.
# Пример
# Улаз
# 4
# Излаз
# 1 2 3
# 1 2 4
# 1 3 4
# 2 3 4

# n = int(input())
# for b1 in range(1, n+1): # broj na loptici 1
#     for b2 in range(b1+1, n+1): # broj na loptici 2
#         for b3 in range(b2+1, n+1): # broj na loptici 3
#             print(b1, b2, b3)
#===================================================================    
    
    
#===================================================================
#Zadatak  4
# Задатак: Коцкице за јамб
# Исписати све резултате бацања три коцкице за јамб у којима је збир бројева једнак задатом броју X (природан број од 3 до 18) ако је редослед коцкица битан (на пример, 2, 2, 3 није исто као 2, 3, 2).
# Улаз: У једној линији стандардног улаза наводи се природан број X (3 ≤ X ≤ 18) који представља збир
# бројева на којима су се зауставиле коцкице.
# Излаз: У свакој линији стандардног излаза исписују се три природна броја (бројеви од 1 до 6) који представљају резултат бацања три коцкице. Резултате приказати сортиране лексикографски (у растућем редоследу
# троцифрених бројева који се формирају од три цифре на коцкицама).
# Пример
# Улаз
# 5
# Излаз
# 1 1 3
# 1 2 2
# 1 3 1
# 2 1 2
# 2 2 1
# 3 1 1

# broj=int(input('trazeni broj '))
# for i in range(1,7):
#     for g in range(1,7):
#         for h in range(1,7):
#             if (i+g+h)==broj:
#                 print(i,g,h)
#===================================================================    
    
#===================================================================
#Zadatak  5
# Задатак: Комбинације поена
# На кошаркашкој утакмици кошеви се бодују са 1, 2 или 3 поена. Потребно је одредити све комбинације
# броја кошева који су бодовани са 1 поеном, са 2 и са 3 поена ако је познат укупан број поена једног тима на
# кошаркашкој утакмици.
# Улаз: У првој линији стандардног улаза налази се укупан број поена на кошаркашкој утакмици (природан
# број између 40 и 150).
# Излаз: Свака линија стандардног излаза треба да садржи број кошева који су бодовани са 3, затим са 2 и на
# крају са 1. Комбинације треба да буду уређене лексикографски.
# Пример
# Улаз
# 6
# Излаз
# 6
# 0 0 6
# 0 1 4
# 0 2 2
# 0 3 0
# 1 0 3
# 1 1 1
# 2 0 0
# bodovi=int(input('broj bodova '))
# for trojke in range(0,bodovi+1,3):
#     for dvojke in range(0,bodovi+1,2):
#         for bod in range(0,bodovi+1):
#             if (trojke+dvojke+bod) == bodovi:
#                 print(trojke//3,dvojke//2, bod)
#===================================================================    
    
#===================================================================
#Zadatak  6











#===================================================================    
    
    
    
    
    
    
    
    
    